In [1]:
import pandas as pd

In [54]:
a = {1:[1, 2, 3, 4], 2:['2', '4', '6', '8'], 3:['1 2 3','2 4 6', '3 6 9', '4 8 12'], 4:['a', 'b', 'c', 'd'], 5:['A', 'B', 'C', 'D']}
df = pd.DataFrame(a)
df

   1  2       3  4  5
0  1  2   1 2 3  a  A
1  2  4   2 4 6  b  B
2  3  6   3 6 9  c  C
3  4  8  4 8 12  d  D

In [55]:
temp = df[3].str.split(expand=True)
temp

   0  1   2
0  1  2   3
1  2  4   6
2  3  6   9
3  4  8  12

In [56]:
df2 = pd.concat([df, temp], axis=1, ignore_index=True)
df2

   0  1       2  3  4  5  6   7
0  1  2   1 2 3  a  A  1  2   3
1  2  4   2 4 6  b  B  2  4   6
2  3  6   3 6 9  c  C  3  6   9
3  4  8  4 8 12  d  D  4  8  12

In [57]:
id(temp), id(df), id(df[3])

(1461765417760, 1461765418432, 1461765416560)

In [58]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      object
 2   2       4 non-null      object
 3   3       4 non-null      object
 4   4       4 non-null      object
 5   5       4 non-null      object
 6   6       4 non-null      object
 7   7       4 non-null      object
dtypes: int64(1), object(7)
memory usage: 384.0+ bytes

In [59]:
df2[1]

0    2
1    4
2    6
3    8
Name: 1, dtype: object

In [60]:
temp1 = df2[1].to_list()
temp1

['2', '4', '6', '8']

In [61]:
for i, s in enumerate(temp1):
    temp1[i] = int(s)
temp1

[2, 4, 6, 8]

In [62]:
df2[1] = temp1
df2

   0  1       2  3  4  5  6   7
0  1  2   1 2 3  a  A  1  2   3
1  2  4   2 4 6  b  B  2  4   6
2  3  6   3 6 9  c  C  3  6   9
3  4  8  4 8 12  d  D  4  8  12

In [63]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      int64
 1   1       4 non-null      int64
 2   2       4 non-null      object
 3   3       4 non-null      object
 4   4       4 non-null      object
 5   5       4 non-null      object
 6   6       4 non-null      object
 7   7       4 non-null      object
dtypes: int64(2), object(6)
memory usage: 384.0+ bytes

In [71]:
temp2 = df2.iloc[[0, 2]]
temp2

   0  1      2  3  4  5  6  7
0  1  2  1 2 3  a  A  1  2  3
2  3  6  3 6 9  c  C  3  6  9

In [72]:
temp2.iloc[1, 1] = 0

In [73]:
temp2

   0  1      2  3  4  5  6  7
0  1  2  1 2 3  a  A  1  2  3
2  3  0  3 6 9  c  C  3  6  9

In [74]:
df2

   0  1       2  3  4  5  6   7
0  1  2   1 2 3  a  A  1  2   3
1  2  4   2 4 6  b  B  2  4   6
2  3  6   3 6 9  c  C  3  6   9
3  4  8  4 8 12  d  D  4  8  12

In [75]:
temp3 = df2.iloc[[1, 3]]
temp3

   0  1       2  3  4  5  6   7
1  2  4   2 4 6  b  B  2  4   6
3  4  8  4 8 12  d  D  4  8  12

In [76]:
total = pd.concat([temp2, temp3], ignore_index=True)
total

   0  1       2  3  4  5  6   7
0  1  2   1 2 3  a  A  1  2   3
1  3  0   3 6 9  c  C  3  6   9
2  2  4   2 4 6  b  B  2  4   6
3  4  8  4 8 12  d  D  4  8  12